import { searchDrug } from "../src/utils/search";

it("should find proper drug", () => {
  const searchInfo = {
    identificationLetter: "SPEED",
    formulation: "",
    shape: "",
    color: "",
    name: "",
  };

  expect(searchDrug(searchInfo)).toBe([
    {
      품목일련번호: 200301809,
      품목명: "스피드펜연질캡슐200밀리그램(이부프로펜)",
      업소일련번호: 19570027,
      업소명: "한미약품(주)",
      성상: "무색내지연한노란색의투명한내용물이들어있는흰노란색의투명한달걀형연질캡슐",
      큰제품이미지:
        "https://nedrug.mfds.go.kr/pbp/cmn/itemImageDownload/147427785474000054",
      표시앞: "SPEED",
      표시뒤: "-",
      의약품제형: "타원형",
      색상앞: "노랑|투명",
      색상뒤: "-",
      분할선앞: "-",
      분할선뒤: "-",
      크기장축: 14.8,
      크기단축: 8.9,
      크기두께: 8.9,
      "이미지생성일자(약학정보원)": 20130312,
      분류번호: "01140",
      분류명: "해열.진통.소염제",
      전문일반구분: "일반의약품",
      품목허가일자: 20030314,
      제형코드명: "연질캡슐제|액상",
      표기내용앞: "-",
      표기내용뒤: "-",
      표기이미지앞: "-",
      표기이미지뒤: "-",
      표기코드앞: "-",
      표기코드뒤: "-",
      변경일자: 20200529,
      "": "",
    },
  ]);
});
